[{"code":"aae", "name":"AAE - Geophysical Observatory, Adis Abeba University, Ethiopia"},
{"code":"aam", "name":"AAM - University of Michigan, Ann Arbor, USA"},
{"code":"aci", "name":"ACI - Universita di Calabria, Cosenza, Italy"},
{"code":"acp", "name":"ACP - Autoridad del Canal de Panama, Balboa-Ancon, Panama"},
{"code":"ade", "name":"ADE - Primary Industries and Resources SA, Adelaide, S.A., Australia"},
{"code":"ags", "name":"AGS - USGS Alaska Seismic Project, Menlo Park, California, USA"},
{"code":"ak", "name":"AK - Alaska Earthquake Center", "aka":["AEI", "AEIC"]},
{"code":"alg", "name":"ALG - CRAAG, Alger-Bouzareah, Algeria"},
{"code":"alq", "name":"ALQ - Albuquerque Seismological Laboratory, Albuquerque, New Mexico, USA"},
{"code":"anza", "name":"ANZA - Anza Seismic Network, IGPP, UC San Diego, La Jolla, California, USA"},
{"code":"aro", "name":"ARO - Observatoire Geophysique d'Arta, Djibouti"},
{"code":"asrs", "name":"ASRS - GSRAS Siberian Branch, Altay-Sayan Seis. Ctr., Novosibirsk, Russia"},
{"code":"at", "name":"AT - National Tsunami Warning Center", "aka":["ATWC"]},
{"code":"ath", "name":"ATH - National Observatory of Athens, Greece"},
{"code":"atl", "name":"ATL - Georgia Institute of Technology, Atlanta, USA"},
{"code":"atx", "name":"ATX - University of Texas Institute for Geophysics, Austin, USA"},
{"code":"aust", "name":"AUST - Geoscience Australia, Canberra, ACT, Australia"},
{"code":"av", "name":"AV - Alaska Volcano Observatory"},
{"code":"awib", "name":"AWIB - Alfred Wegener Inst. of Polar and Marine Research, Bremerhaven, Germany"},
{"code":"azer", "name":"AZER - Rep. Center of Seismic Survey, Azerbaijan Academy of Science, Baku"},
{"code":"azur", "name":"AZUR - Geosciences Azur, Universite de Nice Sophia-Antipolis, Valbonne, France"},
{"code":"bari", "name":"BARI - Osservatorio Sismologico, Universita degli Studi di Bari, Italy"},
{"code":"basv", "name":"BASV - British Antarctic Survey, Cambridge, England, UK"},
{"code":"bdf", "name":"BDF - Observatorio Sismologico, Universidade de Brasilia, Brazil"},
{"code":"belr", "name":"BELR - Inst. of Geochem. and Geophysics, Belarus Academy of Science, Minsk"},
{"code":"beo", "name":"BEO - Seismological Survey of Serbia, Belgrade, Serbia"},
{"code":"ber", "name":"BER - Institutt for geovitenskap, Universitetet i Bergen, Norway"},
{"code":"bgrd", "name":"BGRD - Bundesanstalt fur Geowissenschaften und Rohstoffe, Hannover, Germany"},
{"code":"bgs", "name":"BGS - British Geological Survey, Edinburgh, United Kingdom"},
{"code":"bhd", "name":"BHD - Seismology Unit, Scientific Research Council, Baghdad, Iraq"},
{"code":"bhky", "name":"BHKY - University of Kentucky, Lexington, USA"},
{"code":"bhl", "name":"BHL - Conseil National de la Recherche Scientifique, Beirut, Lebanon"},
{"code":"bji", "name":"BJI - China Earthquake Administration, Beijing, China"},
{"code":"bkk", "name":"BKK - Meteorological Department, Bangkok, Thailand"},
{"code":"bkn", "name":"BKN - Procurement Executive, Ministry of Defence, Blacknest, UK"},
{"code":"bla", "name":"BLA - Virginia Polytechnic Institute and State University, Blacksburg, USA"},
{"code":"blmy", "name":"BLMY - Indian Point Network, Woodward-Clyde Consultants, New Jersey, USA"},
{"code":"bly", "name":"BLY - Institute for Material Testing, Banja Luka, Bosnia and Herzegovina"},
{"code":"bmu", "name":"BMU - Bahrain Meteorological Service, Bahrain"},
{"code":"bng", "name":"BNG - Inst. de Recherche pour le Developpement, Bangui, Cen. African Rep."},
{"code":"bns", "name":"BNS - Geologisches Inst. der Universitat Koln, Bergisch Gladbach, Germany"},
{"code":"bog", "name":"BOG - Instituto Geofisico, Universidad Javeriana, Bogota, Colombia"},
{"code":"bou", "name":"BOU - University of Colorado, Boulder, USA"},
{"code":"bra", "name":"BRA - Geofyzikalny ustav SAV, Bratislava, Slovakia"},
{"code":"brg", "name":"BRG - Seismologisches Observatorium, Berggiesshubel, Germany"},
{"code":"brk", "name":"BRK - University of California, Berkeley, USA"},
{"code":"brl", "name":"BRL - Freie Universitat Berlin, Berlin, Germany"},
{"code":"brs", "name":"BRS - University of Queensland, Brisbane, Australia"},
{"code":"bse", "name":"BSE - Boise State University, Idaho, USA"},
{"code":"buc", "name":"BUC - National Institute for Earth Physics, Bucharest-Magurele, Romania"},
{"code":"bud", "name":"BUD - Hungarian Seismological Institute, Budapest"},
{"code":"bug", "name":"BUG - Ruhr-Universitaet, Bochum, Germany"},
{"code":"bul", "name":"BUL - Goetz Observatory, Bulawayo, Zimbabwe"},
{"code":"but", "name":"BUT - Montana Bureau of Mines and Geology, Butte, USA"},
{"code":"bykl", "name":"BYKL - GSRAS Siberian Branch, Baykal Regional Seis. Center, Irkutsk, Russia"},
{"code":"byt", "name":"BYT - Central Institute of Mines, Katowice, Poland"},
{"code":"cam", "name":"CAM - Massachusetts Institute of Technology, Cambridge, USA"},
{"code":"can", "name":"CAN - Australian National University, Canberra, ACT, Australia"},
{"code":"car", "name":"CAR - FUNVISIS, Caracas, Venezuela"},
{"code":"casc", "name":"CASC - Central American Seismic Center, San Jose, Costa Rica"},
{"code":"cat", "name":"CAT - Instituto Scienze della Terra, Catania, Italy"},
{"code":"cdmg", "name":"CDMG - California Division of Mines and Geology, Sacramento, USA"},
{"code":"cdpj", "name":"CDPJ - Nat. Research Ctr for Disaster Prevention, Ibaraki-ken, Japan--now NIED"},
{"code":"cdr", "name":"CDR - Commissariat a l'Energie Atomique (CEA) Fontenay aux Roses, France"},
{"code":"cdwr", "name":"CDWR - California Department of Water Resources, Sacramento, USA"},
{"code":"cels", "name":"CELS - Comision Hidroelectrica del Rio Lempa, El Salvador"},
{"code":"ceri", "name":"CERI - Center for Earthquake Research and Information, Memphis, Tennessee"},
{"code":"cff", "name":"CFF - Inst. et Observatoire de Physique du Globe, Clermont-Ferrand, France"},
{"code":"cgs", "name":"CGS - California Geological Survey"},
{"code":"chc", "name":"CHC - University of North Carolina, Chapel Hill, USA"},
{"code":"ci", "name":"CI - California Integrated Seismic Network: Southern California Seismic Network (Caltech, USGS Pasadena, and Partners) ", "aka":["PAS"]},
{"code":"cll", "name":"CLL - Geophysikalisches Observatorium, Univ. Leipzig, Collm, Germany"},
{"code":"cnrm", "name":"CNRM - Centre National de la Recherche Scient. et Tech., Rabat, Morocco"},
{"code":"cor", "name":"COR - College of Oceanography, Oregon State University, Corvallis, USA"},
{"code":"crt", "name":"CRT - Instituto Andaluz de Geofisica, Universidad de Granada, Spain"},
{"code":"csc", "name":"CSC - University of South Carolina, Columbia, USA"},
{"code":"csem", "name":"CSEM - Centre Sismologique Euro-Mediterraneen, Bruyeres-le-Chatel, France"},
{"code":"css", "name":"CSS - Geological Survey Department, Nicosia, Cyprus"},
{"code":"dal", "name":"DAL - Southern Methodist University, Dallas, Texas, USA"},
{"code":"dbn", "name":"DBN - Koninkijk Nederlands Meteorologisch Instituut, De Bilt, Netherlands"},
{"code":"dda", "name":"DDA - Directorate of Disaster Affairs, Lodumlu, Ankara, Turkey"},
{"code":"desu", "name":"DESU - CADAFE, Desarrollo Uribante Caparo (DESURCA), San Cristobal, Venezuela"},
{"code":"dhmr", "name":"DHMR - National Seismological Observatory Center, Dhamar, Yemen"},
{"code":"dias", "name":"DIAS - Dublin Institute for Advanced Studies, Ireland"},
{"code":"dja", "name":"DJA - Badan Meteorologi dan Geofisika, Jakarta, Indonesia"},
{"code":"dme", "name":"DME - Department of Minerals and Energy, Pretoria, South Africa"},
{"code":"dmn", "name":"DMN - Department of Mines and Geology, Kathmandu, Nepal"},
{"code":"dngm", "name":"DNGM - Direccao Nacional de Geologia, Maputo, Mozambique"},
{"code":"dnk", "name":"DNK - Danmarks og Gronlands Geologiske Undersogelse, Copenhagen, Denmark"},
{"code":"doe", "name":"DOE - US Department of Energy (and predecessors) -- explosions"},
{"code":"dri", "name":"DRI - Disaster Prevention Research Institute, Kyoto University, Japan"},
{"code":"drs", "name":"DRS - GSRAS, Dagestan Regional Seismological Center, Makhachkala, Russia"},
{"code":"dsit", "name":"DSIT - State Water Works Division (DSI), Ankara, Turkey"},
{"code":"dtm", "name":"DTM - Carnegie Institution of Washington, Washington, DC, USA"},
{"code":"duke", "name":"DUKE - Duke Power Company, South Carolina, USA"},
{"code":"ecx", "name":"ECX - RESNOM, CICESE, Ensenada, Baja California, Mexico"},
{"code":"edm", "name":"EDM - University of Alberta, Edmonton, Canada"},
{"code":"eni", "name":"ENI - Ente Nazionale Idrocarburi, Italy"},
{"code":"ent", "name":"ENT - Geological Survey and Mines Department, Entebbe, Uganda"},
{"code":"ept", "name":"EPT - Kidd Seismological Observatory, University of Texas, El Paso, USA"},
{"code":"erc", "name":"ERC - Centro Ettore Majorana, Erice, Italy"},
{"code":"erij", "name":"ERIJ - Earthquake Research Institute, Univ. of Tokyo, Japan"},
{"code":"euo", "name":"EUO - Department of Geological Sciences, University of Oregon, Eugene, USA"},
{"code":"ew", "name":"EW - ShakeAlert&circledR; Earthquake Early Warning System (USGS and university partners)"},
{"code":"exp", "name":"EXP - Explosion parameters from any group other than DOE or predecessors"},
{"code":"fbb", "name":"FBB - Geologisches Landesamt Baden-Wuerttemberg (LEDBW), Freiburg, Germany"},
{"code":"fdf", "name":"FDF - IPG Observatoire Geophysique, St. Pierre, Martinique"},
{"code":"fir", "name":"FIR - Universita Degli Studi di Firenze, Firenze, Italy"},
{"code":"flag", "name":"FLAG - Arizona Earthquake Information Center, Flagstaff, USA"},
{"code":"fnet", "name":"FNET - F-net Broadband Seismograph Network, University of Tokyo, Japan"},
{"code":"fog", "name":"FOG - Osservatorio V. Nigri, Foggia, Italy"},
{"code":"fur", "name":"FUR - Geophysikalisches Obs. der Univ. Muenchen, Fuerstenfeldbruck, Germany"},
{"code":"gar", "name":"GAR - Complex Seismological Expedition, Garm, Tajikistan"},
{"code":"gbzt", "name":"GBZT - TUBITAK, Marmara Research Center, Gebze, Turkey"},
{"code":"gcg", "name":"GCG - INSIVUMEH, Guatemala City, Guatemala"},
{"code":"gcmt", "name":"GCMT - Lamont-Doherty Earth Observatory Global CMT project, New York, USA"},
{"code":"gen", "name":"GEN - Dipart. Studio del Territorio e Risorse, Universita di Genova, Italy"},
{"code":"geot", "name":"GEOT - Teledyne Geotech Corporation, Garland, Texas, USA"},
{"code":"gfu", "name":"GFU - Geofyzikalni ustav Akademie vid Ceske republiky, Praha, Czech Republic"},
{"code":"gfz", "name":"GFZ - GeoForschungsZentrum Potsdam, Telegrafenberg, Potsdam, Germany"},
{"code":"gia", "name":"GIA - Geophysical Institute, Univ. of Alaska, Fairbanks, USA"},
{"code":"gii", "name":"GII - Geophysical Institute of Israel, Lod, Israel"},
{"code":"gol", "name":"GOL - Geophysics Department, Colorado School of Mines, Golden, USA"},
{"code":"gom", "name":"GOM - Observatoire Volcanologique de Goma, Goma, Dem. Republic of the Congo"},
{"code":"grc", "name":"GRC - Observatoire Sismologique, Garchy, France"},
{"code":"grf", "name":"GRF - BGR, Zentralobservatorium Graefenberg, Erlangen, Germany"},
{"code":"grn", "name":"GRN - Lab. de Geophysique Interne et de Tectonophysique, Grenoble, France"},
{"code":"gsdm", "name":"GSDM - Geological Survey Department of Malawi, Zomba, Malawi"},
{"code":"guc", "name":"GUC - Departamento de Geofisica, Universidad de Chile, Santiago"},
{"code":"guv", "name":"GUV - CVG Electrificacion del Caroni (EDELCA) Guri, Venezuela"},
{"code":"hacu", "name":"HACU - Hacettepe University, Ankara, Turkey"},
{"code":"hdc", "name":"HDC - Universidad Nacional, Campus Omar Dengo, Heredia, Costa Rica"},
{"code":"hel", "name":"HEL - Seismologian Laitos, Helsingin Yliopisto, Helsinki, Finland"},
{"code":"hfs", "name":"HFS - The Swedish Defence Research Agency, FOI, Stockholm, Sweden"},
{"code":"hig", "name":"HIG - Hawaii Institute of Geophysics, Honolulu, USA"},
{"code":"hkc", "name":"HKC - Hong Kong Observatory, Kowloon, Hong Kong, China"},
{"code":"hkt", "name":"HKT - University of Texas Marine Science Institute, Galveston, USA (now ATX)"},
{"code":"hlw", "name":"HLW - National Research Inst. of Astronomy and Geophysics, Helwan, Egypt"},
{"code":"hnr", "name":"HNR - Ministry of Natural Resources, Honiara, Solomon Islands"},
{"code":"hon", "name":"HON - NOAA, Pacific Tsunami Warning Center, Honolulu, Hawaii"},
{"code":"hrs", "name":"HRS - Earthquake and Volcano Observatory, Hirosaki University, Japan"},
{"code":"hrv", "name":"HRV - Harvard University, Cambridge, Massachusetts"},
{"code":"hss", "name":"HSS - Inst. of Seismology and Volcanology, Hokkaido Univ., Sapporo, Japan"},
{"code":"hv", "name":"HV - Hawaii Volcano Observatory"},
{"code":"hvo", "name":"HVO - USGS Hawaiian Volcano Observatory, Hawaii, USA"},
{"code":"hyb", "name":"HYB - National Geophysical Research Institute, Hyderabad, India"},
{"code":"ice", "name":"ICE - Instituto Costariccense de Electricidad, San Jose, Costa Rica"},
{"code":"idc", "name":"IDC - Internation Data Center"},
{"code":"igil", "name":"IGIL - Inst. Geofisico do Infante D. Luis, Univ. de Lisboa, Lisbon, Portugal"},
{"code":"iim", "name":"IIM - Instituto de Ingenieria, UNAM, Mexico City, Mexico"},
{"code":"indr", "name":"INDR - Inst. Nac. de Recursos Hidraulicos, Santo Domingo, Dominican Rep."},
{"code":"inel", "name":"INEL - Idaho Nat. Engineering and Environmental Laboratory, Idaho Falls, USA"},
{"code":"inet", "name":"INET - Instituto Nicaraguense de Estudios Territoriales, Managua, Nicaragua"},
{"code":"inmg", "name":"INMG - Instituto de Meteorologia, Lisbon, Portugal"},
{"code":"inpp", "name":"INPP - Ignalina Nuclear Power Plant, Ignalina, Lithuania"},
{"code":"intv", "name":"INTV - INTEVEP, Caracas, Venezuela"},
{"code":"iny", "name":"INY - Cornell University, Ithaca, New York, USA"},
{"code":"ipec", "name":"IPEC - Ustav fyziky Zeme, Masaryk University, Brno, Czech Republic"},
{"code":"irsa", "name":"IRSA - Institutul Roman de Seismologie Aplicata, Bucharest, Romania"},
{"code":"isc", "name":"ISC - International Seismological Centre, UK"},
{"code":"iscgem", "name":"ISCGEM - ISC-GEM"},
{"code":"isk", "name":"ISK - Kandilli Observatory & Earthquake Research Inst., Istanbul, Turkey"},
{"code":"ismp", "name":"ISMP - USGS Induced Seismicity Project"},
{"code":"ist", "name":"IST - Istanbul Technical University, Maslak, Istanbul, Turkey"},
{"code":"istp", "name":"ISTP - Instituto Superior Tecnico, Lisbon, Portugal"},
{"code":"jck", "name":"JCK - Geologisches Landesamt Nordrhein-Westfalen, Krefeld, Germany"},
{"code":"jen", "name":"JEN - Inst. fuer Geowissenschaften, Friedrich-Schiller-Univ., Jena, Germany"},
{"code":"jhi", "name":"JHI - Regional Research Laboratory, Jorhat, India"},
{"code":"jma", "name":"JMA - Japan Meteorological Agency, Tokyo, Japan"},
{"code":"jrq", "name":"JRQ - Centro de Geociencias, UNAM, Queretaro, Mexico"},
{"code":"jsn", "name":"JSN - University of the West Indies, Mona, Jamaica"},
{"code":"jso", "name":"JSO - Jordan Seismological Observatory, Amman"},
{"code":"kazk", "name":"KAZK - Seismological Institute, Kazakhstan Academy of Sciences, Almaty"},
{"code":"kbc", "name":"KBC - Institut de Recherches Geologiques et Minieres, Ekona, Cameroon"},
{"code":"kgs", "name":"KGS - Kansas Geological Survey, University of Kansas, Lawrence, USA"},
{"code":"kisr", "name":"KISR - Kuwait Institute for Scientific Research, Safat, Kuwait"},
{"code":"klm", "name":"KLM - Malaysian Meteorological Department, Petaling Jaya, Selangor, Malaysia"},
{"code":"knet", "name":"KNET - Kyrgyz Broadband Seismic Network, La Jolla, Calif. and Kyrgyzstan"},
{"code":"kors", "name":"KORS - GSRAS, Kola Regional Seismological Center, Apatity, Russia"},
{"code":"kowa", "name":"KOWA - Ecole Nationale d'Ingenieurs, Departement de Geologie, Bamako, Mali"},
{"code":"krsc", "name":"KRSC - GSRAS, Kamchatka Regional Seismo. Center, Petropavlovsk, Russia"},
{"code":"krw", "name":"KRW - Geophysikalisches Institut, Karlsruhe, Germany"},
{"code":"krym", "name":"KRYM - Crimean Geophysical Institute, Ukraine Academy of Science, Ukraine"},
{"code":"kuk", "name":"KUK - Ghana Geological Survey Department, Accra, Ghana"},
{"code":"kyrg", "name":"KYRG - Institute of Seismology, Kyrgyzstan Academy of Sciences, Bishkek"},
{"code":"kyt", "name":"KYT - Faculty of Science, Kyoto University, Japan"},
{"code":"lasa", "name":"LASA - Large Aperture Seismic Array, Billings, Montana (closed)"},
{"code":"lbtb", "name":"LBTB - Geological Survey of Botswana, Lobatse, Botswana"},
{"code":"ld", "name":"LD - Lamont-Doherty Cooperative Seismographic Network"},
{"code":"ldg", "name":"LDG - CEA Lab. de Detection et de Geophysique, Bruyeres-le-Chatel, France"},
{"code":"ldn", "name":"LDN - University of Western Ontario, London, Ontario, Canada"},
{"code":"ldsn", "name":"LDSN - Libyan Center for Remote Sensing and Space Science, Tripoli, Libya"},
{"code":"lei", "name":"LEI - Institut fuer Geophysik und Geologie, Universitaet Leipzig, Germany"},
{"code":"lgs", "name":"LGS - Lithuanian Geological Survey, Vilnius, Lithuania"},
{"code":"lic", "name":"LIC - Station Geophysique de Lamto, N'Douci, Cote d'Ivoire"},
{"code":"lim", "name":"LIM - Instituto Geofisico del Peru, Lima, Peru"},
{"code":"ljc", "name":"LJC - Inst. of Geop. and Planet. Phys., UC San Diego, La Jolla, Calif, USA"},
{"code":"lju", "name":"LJU - ARSO, Urad za seizmologijo, Ljubljana, Slovenia"},
{"code":"lli", "name":"LLI - Instituto Internazionale di Vulcanologia--CNR, Catania, Italy"},
{"code":"lmm", "name":"LMM - Servico Meteorologico de Mocambique, Maputo, Mozambique (closed)"},
{"code":"loa", "name":"LOA - Los Alamos Scientific Laboratories, Los Alamos, New Mexico, USA"},
{"code":"lpa", "name":"LPA - Observatorio Astronomico, Univ. Nacional de La Plata, Argentina"},
{"code":"lpz", "name":"LPZ - Observatorio San Calixto, La Paz, Bolivia"},
{"code":"lsz", "name":"LSZ - Geological Survey Department, Lusaka, Zambia"},
{"code":"lub", "name":"LUB - Texas Tech University, Lubbock, USA"},
{"code":"lvm", "name":"LVM - Lawrence Livermore National Laboratory, Livermore, California, USA"},
{"code":"lvv", "name":"LVV - Carpathian Seismo. Dept., Ukraine Academy of Science, Lviv, Ukraine"},
{"code":"lwi", "name":"LWI - Departement de Geophysique, Lwiro, Democratic Republic of the Congo"},
{"code":"macro", "name":"MACRO - Macroseismic location"},
{"code":"mb", "name":"MB - Montana Bureau of Mines and Geology"},
{"code":"mbo", "name":"MBO - Institut de Recherche pour le Developpement, M'Bour, Senegal"},
{"code":"mdd", "name":"MDD - Instituto Geografico Nacional, Madrid, Spain"},
{"code":"mel", "name":"MEL - Seismology Research Centre, Melbourne, Australia"},
{"code":"meri", "name":"MERI - Maharashtra Engineering Research Institute, Nashik, India"},
{"code":"mes", "name":"MES - Instituto Geofisico e Geodetico, Messina, Italy"},
{"code":"mhi", "name":"MHI - Seismological Observatory, Mashhad, Iran"},
{"code":"mnlo", "name":"MNLO - USGS National Center for Earthquake Research, Menlo Park, Calif, USA"},
{"code":"mnm", "name":"MNM - University of Minnesota, Minneapolis, USA"},
{"code":"mold", "name":"MOLD - Institute of Geophysics and Geology, Chisinau, Moldova"},
{"code":"mrb", "name":"MRB - Institut Cartografic de Catalunya (ICC), Barcelona, Spain"},
{"code":"msco", "name":"MSCO - Mesa State College, Grand Junction, Colorado, USA"},
{"code":"msku", "name":"MSKU - Universite des Sciences et Techniques de Masuku, Franceville, Gabon"},
{"code":"mso", "name":"MSO - University of Montana, Missoula, USA"},
{"code":"mtat", "name":"MTAT - Mineral Research and Exploration Institute (MTA), Ankara, Turkey"},
{"code":"mui", "name":"MUI - Geophysics Department, Ferdowsi University, Mashhad, Iran"},
{"code":"mvov", "name":"MVOV - Montserrat Volcano Observatory, Mango Hill, Montserrat"},
{"code":"nai", "name":"NAI - Geology Department, University of Nairobi, Nairobi, Kenya"},
{"code":"nao", "name":"NAO - NTNF/NORSAR, Kjeller, Norway"},
{"code":"nars", "name":"NARS - NARS network, University of Utrecht, The Netherlands"},
{"code":"nasc", "name":"NASC - National Antarctic Scientific Center of Ukraine, Kiev, Ukraine"},
{"code":"nat", "name":"NAT - Departamento de Fisica Teorica e Experimental, UFRN, Natal, Brazil"},
{"code":"nc", "name":"NC - California Integrated Seismic Network: Northern California Seismic System (UC Berkeley, USGS Menlo Park, and Partners)"},
{"code":"ndi", "name":"NDI - India Meteorological Department, New Delhi"},
{"code":"ne", "name":"NE - New England Seismic Network"},
{"code":"ned", "name":"NED - Delaware Geological Survey, Newark"},
{"code":"ners", "name":"NERS - GSRAS, Northeastern Regional Seismological Center, Magadan, Russia"},
{"code":"ngy", "name":"NGY - RCSVDM, Graduate School of Environmental Studies, Nagoya Univ., Japan"},
{"code":"nic", "name":"NIC - Geological Survey Department, Nicosia, Cyprus"},
{"code":"nied", "name":"NIED - Nat. Res. Inst. for Earth Sci. and Disaster Prevention, Tsukuba, Japan"},
{"code":"nipr", "name":"NIPR - National Institute of Polar Research, Tokyo, Japan"},
{"code":"nm", "name":"NM - New Madrid Seismic Network"},
{"code":"nn", "name":"NN - Nevada Seismological Laboratory"},
{"code":"nnc", "name":"NNC - Nat. Nuclear Center, Inst. of Geophysical Research, Almaty, Kazakhstan"},
{"code":"nou", "name":"NOU - Institut de Recherche pour le Developpement, Noumea, New Caledonia"},
{"code":"nsau", "name":"NSAU - National Space Agency of Ukraine, Kiev, Ukraine"},
{"code":"nssc", "name":"NSSC - National Syrian Seismological Center, Damascus"},
{"code":"nssp", "name":"NSSP - National Survey of Seismic Protection, Yerevan, Armenia"},
{"code":"obm", "name":"OBM - Mongolian Academy of Sciences, Ulaanbaatar"},
{"code":"obn", "name":"OBN - GSRAS, Russian National Seismological Center, Obninsk, Russia"},
{"code":"ogso", "name":"OGSO - OhioSeis Network, Ohio Geological Survey, Columbus"},
{"code":"ok", "name":"OK - Oklahoma Geological Survey Statewide Network, Norman, USA ", "aka":["TUL", "OGS"]},
{"code":"oman", "name":"OMAN - Department of Earth Sciences, Sultan Qaboos University, Al-Khod, Oman"},
{"code":"ompt", "name":"OMPT - Observatoire Midi-Pyrenees, Toulouse, France"},
{"code":"ott", "name":"OTT - Geological Survey of Canada, Ottawa, Canada"},
{"code":"oul", "name":"OUL - Sodankylan Geofysiikan Observatorio, Oulun Yliopisto, Oulu, Finland"},
{"code":"ovo", "name":"OVO - Osservatorio Vesuviano, Naples, Italy"},
{"code":"pal", "name":"PAL - Lamont-Doherty Earth Observatory, Palisades, New York. USA"},
{"code":"par", "name":"PAR - Institut de Physique du Globe, Univ. P et M Curie, Paris, France"},
{"code":"pda", "name":"PDA - Instituto de Meteorologia, Obs. Afonso Chaves, Ponta Delgada, Azores"},
{"code":"pdg", "name":"PDG - Seizmoloski zavod Crne Gore, Podgorica, Montenegro"},
{"code":"pepp", "name":"PEPP - Princeton Earth Physics Project, Princeton, New Jersey, USA"},
{"code":"pgc", "name":"PGC - Geological Survey of Canada, Pacific Geoscience Centre, Sidney, BC"},
{"code":"pgec", "name":"PGEC - Pacific Gas and Electric, California, USA"},
{"code":"pins", "name":"PINS - Pakistan Inst. of Nuclear Science and Technology, Rawalpindi, Pakistan"},
{"code":"pivs", "name":"PIVS - Philippine Inst. of Volcanology & Seismology, Quezon City, Philippines"},
{"code":"plv", "name":"PLV - Inst. of Geophysics, Vietnamese Acad. of Science and Technology, Hanoi"},
{"code":"pmg", "name":"PMG - Geological Survey, Port Moresby, Papua New Guinea"},
{"code":"pmr", "name":"PMR - National Tsunami Warning Center, Palmer, Alaska, USA"},
{"code":"pnnl", "name":"PNNL - Pacific Northwest National Laboratory, Richland, Washington, USA"},
{"code":"polr", "name":"POLR - POLARIS Project, Ottawa, Canada"},
{"code":"ppt", "name":"PPT - Laboratoire de Geophysique, Papeete, French Polynesia"},
{"code":"pr", "name":"PR - Puerto Rico Seismic Network"},
{"code":"pre", "name":"PRE - Council for Geoscience, Pretoria, South Africa"},
{"code":"pro", "name":"PRO - Osservatorio Valerio, Pesaro, Italy"},
{"code":"prt", "name":"PRT - Osservatorio San Domenico, Prato, Italy"},
{"code":"pt", "name":"PT - Pacific Tsunami Warning Center ", "aka":["PTWC"]},
{"code":"ptn", "name":"PTN - State University of New York, Potsdam, New York, USA"},
{"code":"pto", "name":"PTO - Porto (Serro do Pilar), Portugal"},
{"code":"qcp", "name":"QCP - Manila Observatory, Ateneo de Manila Univ., Manila, Philippines"},
{"code":"qdm", "name":"QDM - Queensland Department of Mines, Brisbane, Australia"},
{"code":"qmb", "name":"QMB - University of Leeds, Yorkshire, UK"},
{"code":"que", "name":"QUE - Pakistan Meteorological Department, Quetta, Pakistan"},
{"code":"qui", "name":"QUI - Escuela Politecnica Nacional, Quito, Ecuador"},
{"code":"rab", "name":"RAB - Geological Survey, Vulcano Observatory, Rabaul, Papua New Guinea"},
{"code":"rdj", "name":"RDJ - Observatorio Nacional, Rio de Janeiro, Brazil"},
{"code":"ren", "name":"REN - University of Nevada, Reno, USA"},
{"code":"rex", "name":"REX - Brigham Young University - Idaho, Rexburg, Idaho, USA"},
{"code":"rey", "name":"REY - Veourstofa Islands, Reykjavik, Iceland"},
{"code":"ript", "name":"RIPT - Research Inst. of Pulse Technique, Ministry for Atomic Energy, Russia"},
{"code":"rlp", "name":"RLP - Landeserdbebendienst Rheinland-Pfalz, Mainz, Germany"},
{"code":"rmod", "name":"RMOD - Russian Ministry of Defense, Russia"},
{"code":"rom", "name":"ROM - Istituto Nazionale di Geofisica e Vulcanologia, Rome, Italy"},
{"code":"rsnc", "name":"RSNC - Red Sismica Nacional de Colombia, INGEOMINAS, Bogota, Colombia"},
{"code":"rspr", "name":"RSPR - Red Sismica de Puerto Rico, Universidad de Puerto Rico, Mayaguez"},
{"code":"ruvs", "name":"RUVS - Rede Universitaria de Vigilancia Sismovulcanica, Sao Miguel, Azores"},
{"code":"ryd", "name":"RYD - King Saud University, Riyadh, Saudi Arabia"},
{"code":"sakl", "name":"SAKL - Sakhalin Complex Research Institute, Novoalexandrovsk -- now SKHL net"},
{"code":"sand", "name":"SAND - Sandia Laboratories, Albuquerque, New Mexico, USA"},
{"code":"sapn", "name":"SAPN - Emergency Management Office, Saipan, Northern Mariana Islands"},
{"code":"sbs", "name":"SBS - Institut National de la Meteorologie, Tunis, Tunisia"},
{"code":"scp", "name":"SCP - Pennsylvania State University, State College, USA"},
{"code":"sdd", "name":"SDD - Universidad Autonoma de Santo Domingo, Dominican Republic"},
{"code":"se", "name":"SE - Center for Earthquake Research and Information"},
{"code":"sea", "name":"SEA - Geophysics Program, University of Washington, Seattle, USA"},
{"code":"seo", "name":"SEO - Korean Meteorological Administration, Seoul, South Korea"},
{"code":"sfs", "name":"SFS - Real Instituto y Observatorio de la Armada, San Fernando, Spain"},
{"code":"shv", "name":"SHV - Inst. of Seismology and Volcanology, Kyushu Univ., Shimabara, Japan"},
{"code":"sja", "name":"SJA - Instituto Nacional de Prevencion Sismica, San Juan, Argentina"},
{"code":"skhl", "name":"SKHL - GSRAS, Sakhalin Regional Seismological Ctr., Yuzhno-Sakhalinsk, Russia"},
{"code":"sko", "name":"SKO - Seismological Observatory, Skopje University, Macedonia"},
{"code":"slc", "name":"SLC - University of Utah, Salt Lake City, USA"},
{"code":"slci", "name":"SLCI - University of Utah Research Institute, Salt Lake City, USA"},
{"code":"slm", "name":"SLM - St. Louis University, St. Louis, Missouri, USA"},
{"code":"snet", "name":"SNET - Servicio Nac. de Estudios Territoriales, San Salvador, El Salvador"},
{"code":"snm", "name":"SNM - New Mexico Institute of Mining and Technology, Socorro, USA"},
{"code":"snsn", "name":"SNSN - Saudi NSN, King Abdulaziz City for Sci & Tech, Riyadh, Saudi Arabia"},
{"code":"sof", "name":"SOF - Section of Seismology, Bulgarian Academy of Sciences, Sofia, Bulgaria"},
{"code":"sors", "name":"SORS - Republic Hydrometeorological Inst., Banja Luka, Bosnia-Herzegovina"},
{"code":"spec", "name":"SPEC - Special NEIS solution"},
{"code":"spgm", "name":"SPGM - Service de Physique du Globe, Rabat Agdal, Morocco"},
{"code":"srpd", "name":"SRPD - Savannah River Laboratory, Aiken, South Carolina"},
{"code":"ssnc", "name":"SSNC - Centro Nacional de Investigaciones Sismologicas, Santiago de Cuba, Cuba"},
{"code":"sso", "name":"SSO - Osservatorio Geofisico Sperimentale, Macerata, Italy"},
{"code":"str", "name":"STR - Ecole et Observatoire des Sciences de la Terre, Strasbourg, France"},
{"code":"stu", "name":"STU - Institut fuer Geophysik der Universitaet Stuttgart, Stuttgart, Germany"},
{"code":"sva", "name":"SVA - Department of Mineral Resources, Suva, Fiji"},
{"code":"svsa", "name":"SVSA - Sistema de Vigilancia Sismologica dos Acores, Ponta Delgada, Azores"},
{"code":"tajk", "name":"TAJK - Tajikistan Academy of Sciences, Dushanbe, Tajikistan"},
{"code":"tan", "name":"TAN - Institut et Observatoire Geophysique d'Antananarivo, Madagascar"},
{"code":"tap", "name":"TAP - Central Weather Bureau, Taipei, Taiwan"},
{"code":"tato", "name":"TATO - Institute of Earth Sciences, Academia Sinica, Taipei, Taiwan"},
{"code":"tau", "name":"TAU - University of Tasmania, Hobart, Australia"},
{"code":"tbu", "name":"TBU - Environmental Physics Institute, Tibet University, Lhasa, China"},
{"code":"teh", "name":"TEH - Institute of Geophysics, University of Tehran, Iran"},
{"code":"the", "name":"THE - Geophysical Laboratory, University of Thessaloniki, Greece"},
{"code":"thr", "name":"THR - Intl. Inst. of Earthquake Engineering and Seismology, Tehran, Iran"},
{"code":"tif", "name":"TIF - Institute of Geophysics, Academy of Sciences of Georgia, Tbilisi, Georgia"},
{"code":"tir", "name":"TIR - Seismological Center, Academy of Sciences of Albania, Tirana"},
{"code":"toh", "name":"TOH - AOB, Graduate School of Science, Tohoku University, Sendai, Japan"},
{"code":"tol", "name":"TOL - Observatorio Geofisico de Toledo, Spain (MDD network)"},
{"code":"tri", "name":"TRI - Ist. Nazle. di Oceanografia e di Geof. Sperimentale, Trieste, Italy"},
{"code":"trkm", "name":"TRKM - Institute of Seismology, Turkmenistan Academy of Science, Ashgabat"},
{"code":"trn", "name":"TRN - University of the West Indies, St. Augustine, Trinidad"},
{"code":"tva", "name":"TVA - Tennessee Valley Authority, Knoxville, Tennessee"},
{"code":"tx", "name":"TX - Texas Seismological Network (TexNet)", "aka":["TEXNET", "BEG"]},
{"code":"tzn", "name":"TZN - University of Dar es Salaam, Tanzania"},
{"code":"uav", "name":"UAV - Laboratorio de Geofisica, Universidad de los Andes, Merida, Venezuela"},
{"code":"ubc", "name":"UBC - University of British Columbia, Vancouver, B.C., Canada"},
{"code":"ubic", "name":"UBIC - Univ. de Barcelona i Institut d'Estudis Catalans, Barcelona, Spain"},
{"code":"ucc", "name":"UCC - Observatoire Royal de Belgique, Uccle, Brussels, Belgium"},
{"code":"ucr", "name":"UCR - Seccion de Sismologia, Univ. de Costa Rica, San Jose, Costa Rica"},
{"code":"udec", "name":"UDEC - Universidad de Concepcion, Concepcion, Chile"},
{"code":"udo", "name":"UDO - Centro de Sismologia, Universidad de Oriente, Cumana, Venezuela"},
{"code":"unah", "name":"UNAH - Universidad Nacional Autonoma de Honduras, Tegucigalpa, Honduras"},
{"code":"unm", "name":"UNM - Instituto de Geofisica, UNAM, Mexico City, DF, Mexico"},
{"code":"upa", "name":"UPA - Instituto de Geociencias, Universidad de Panama, Panama"},
{"code":"upp", "name":"UPP - Department of Earth Sciences, Uppsala University, Uppsala, Sweden"},
{"code":"upsl", "name":"UPSL - University of Patras Seismological Laboratory, Patras, Greece"},
{"code":"urs", "name":"URS - Kochi University, Kochi, Japan"},
{"code":"us", "name":"US - USGS National Earthquake Information Center, PDE", "aka":["GS, NEIC"]},
{"code":"usaf", "name":"USAF - US Air Force Technical Applications Center, Melbourne, Florida, USA"},
{"code":"usav", "name":"USAV - USGS Alaska Volcano Observatory, Anchorage, USA"},
{"code":"usbr", "name":"USBR - US Bureau of Reclamation, Denver, Colorado, USA"},
{"code":"usc", "name":"USC - University of Southern California, Los Angeles, USA"},
{"code":"uscv", "name":"USCV - USGS Cascades Volcano Observatory, Vancouver WA, USA"},
{"code":"usgs", "name":"USGS - US Geological Survey--other than ABQ, AGS, MNLO, NEIC, HVO and USAVO"},
{"code":"utsu", "name":"UTSU - Utsunomiya University, Japan"},
{"code":"uu", "name":"UU - University of Utah Seismograph Stations"},
{"code":"uvc", "name":"UVC - Universidad del Valle, Cali, Colombia"},
{"code":"uw", "name":"UW - Pacific Northwest Seismic Network ", "aka":["PNSN"]},
{"code":"uzbk", "name":"UZBK - Institute of Seismology, Uzbekistan Academy of Sciences, Tashkent"},
{"code":"vao", "name":"VAO - Inst. de Astron., Geof. e Ciencias Atmos., Univ. de Sao Paulo, Brazil"},
{"code":"war", "name":"WAR - Instytutu Geofizyki, Polskiej Akademii Nauk, Warsaw, Poland"},
{"code":"wel", "name":"WEL - Inst. of Geological and Nuclear Sciences, Lower Hutt, New Zealand"},
{"code":"wes", "name":"WES - Weston Observatory, Boston College, Weston, Massachusetts, USA"},
{"code":"wien", "name":"WIEN - Inst. fuer Meteorologie und Geophysik, Univ. Wien, Vienna, Austria"},
{"code":"wihg", "name":"WIHG - Wadia Institute of Himalayan Geology, Dehra Dun, India"},
{"code":"wwc", "name":"WWC - Woodward-Clyde Consultants, California"},
{"code":"yars", "name":"YARS - GSRAS Siberian Branch, Yakutiya Reg. Seis. Center, Yakutsk, Russia"},
{"code":"zag", "name":"ZAG - Geophysical Institute, University of Zagreb, Croatia"},
{"code":"zamg", "name":"ZAMG - ZentralAnstalt fuer Meteorologie und Geodynamik, Vienna, Austria"},
{"code":"zon", "name":"ZON - Universidad Nacional de San Juan, San Juan, Argentina"},
{"code":"zur", "name":"ZUR - Schweizerischer Erdbebendienst, Zurich, Switzerland"}]